In [1]:
import pandas as pd
import numpy as np

## 1. 데이터프레임 생성

In [2]:
df = pd.DataFrame(np.arange(12).reshape(3, 4),
                  columns=['A', 'B', 'C', 'D'])

In [3]:
df

   A  B   C   D
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

## 2. 인덱스로 행 삭제

In [4]:
df.drop(df.index[0])

   A  B   C   D
1  4  5   6   7
2  8  9  10  11

## 3. 열의 로직으로 삭제 

-  데이터프레임의 로직을 확인한 후에 인덱스 정보를 제공해서 처리

In [5]:
df['A'] > 4

0    False
1    False
2     True
Name: A, dtype: bool

### 참값의 인덱스만 추출

In [6]:
df[df['A'] > 4].index

Int64Index([2], dtype='int64')

### 특정 행 삭제

In [7]:
df.drop(df[df['A'] > 4].index)

   A  B  C  D
0  0  1  2  3
1  4  5  6  7

## 4. 행 삭제 : 특정 행만 선택

### 인덱스 검색에 논리값 배열 처리

In [8]:
df2 = df[df.A <= 4]

In [9]:
df2

   A  B  C  D
0  0  1  2  3
1  4  5  6  7

### loc 인덱서에서 논리값 배열 처리

In [10]:
df3 = df.loc[df["A"] <= 4 ]

In [11]:
df3

   A  B  C  D
0  0  1  2  3
1  4  5  6  7

## 5.  DataFrame.query() 사용 행 삭제하기

- sql의 where 절은 판다스의 데이터프레임의 query 메서드로 처리
- sql의 where 절은 논리식을 받아서 행을 추출 처리
- 특정 행만 추출해서 사용하면 행삭제처리와 동일

In [12]:
technologies = {
    'Courses':["Spark","PySpark","Hadoop","Python"],
    'Fee' :[22000,25000,np.nan,24000],
    'Duration':['30day',None,'55days',np.nan],
    'Discount':[1000,2300,1000,np.nan]
          }
df = pd.DataFrame(technologies)
print(df)

   Courses      Fee Duration  Discount
0    Spark  22000.0    30day    1000.0
1  PySpark  25000.0     None    2300.0
2   Hadoop      NaN   55days    1000.0
3   Python  24000.0      NaN       NaN

## 5-1 등가연산

In [13]:
df22=df.query("Courses == 'Spark'")

In [14]:
df22

  Courses      Fee Duration  Discount
0   Spark  22000.0    30day    1000.0

## 5-2 변수 사용하기

In [15]:
value='Spark'
df23=df.query("Courses == @value")

In [16]:
df23

  Courses      Fee Duration  Discount
0   Spark  22000.0    30day    1000.0

## 5-3 비등가 Not equals,

In [17]:
df.query("Courses != 'Spark'")

   Courses      Fee Duration  Discount
1  PySpark  25000.0     None    2300.0
2   Hadoop      NaN   55days    1000.0
3   Python  24000.0      NaN       NaN

## 5-4 특정 값 포함 :  in

In [18]:
df.query("Courses in ('Spark','PySpark')")

   Courses      Fee Duration  Discount
0    Spark  22000.0    30day    1000.0
1  PySpark  25000.0     None    2300.0

## 5-5 여러 논리 연산식 : multiple conditions

In [19]:
df.query("Fee >= 23000.0 and Fee <= 24000.0")

  Courses      Fee Duration  Discount
3  Python  24000.0      NaN       NaN